Revit 2027 API
RailingType.TopRailType Property
 The type of the top rail in the railing system.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId TopRailType { get; set; }
Public Property TopRailType As ElementId
	Get
	Set
public:
property ElementId^ TopRailType {
	ElementId^ get ();
	void set (ElementId^ value);
}
member TopRailType : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The topRailType is not a valid top rail type.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
RailingType Class
Autodesk.Revit.DB.Architecture Namespace